<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
   "http://www.w3.org/TR/html4/loose.dtd">
<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; CHARSET=iso-8859-1">
   <META NAME="Author" CONTENT="METALBRAIN">
   <META NAME="GENERATOR" CONTENT="EDIT">
   <META NAME="description" CONTENT="SevenuP - Novedades">
   <META NAME="keywords" CONTENT="SevenuP Novedades Metalbrain">
   <TITLE>SevenuP</TITLE>
</HEAD>
<BODY TEXT="#FFFFFF" BGCOLOR="#003366" LINK="#FFFFFF" VLINK="#FFFFFF" ALINK="#FFFFFF">
<CENTER>
<P><H1>Novedades</H1>
</CENTER>
<DL>
<DT><I>2012-04-27</I>:<DD>
<P><B><FONT SIZE="+1">&iexcl;Cuanto tiempo!</FONT></B>
<P>M&aacute;s de cuatro a&ntilde;os desde la &uacute;ltima noticia. M&aacute;s de 6 desde la &uacute;ltima
versi&oacute;n publicada. Es mucho tiempo. Ten&iacute;a la intenci&oacute;n de continuar, pero ya no estoy tan
seguro... No parece que me entren las ganas necesarias...<BR>
<BR>
Pero bueno, el caso es que la versi&oacute;n compilada de Linux no es Unicode, y puesto que algunas de las principales
distribuciones de Linux (incluyendo Ubuntu) son 100% Unicode, muchos usuarios no pueden ejecutar la versi&oacute;n
compilada, y para colmo tampoco pueden compilarse su propia versi&oacute;n, puesto que hacen falta cambios, y para
colmo algunos cambios introducidos en la versi&oacute;n 4.0 de GCC significan que el c&oacute;digo ya no es compilable.
Arreglando todo esto, cre&eacute; hace ya tiempo una versi&oacute;n WIP de SevenuP 1.21 y le pas&eacute; el enlace a
varias personas, y ahora me han pedido que publique esa versi&oacute;n... as&iacute; que he pensado... &iquest;y por
que no? Ya est&aacute; disponible en la p&aacute;gina de descargas.
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2008-02-19</I>:<DD>
<P><B><FONT SIZE="+1">Est&uacute;pidos Antivirus</FONT></B>
<P><UL>
<LI>Algunos est&uacute;pidos antivirus est&aacute;n considerando SevenuP.exe un archivo sospechoso
porque utilic&eacute; uPack para reducir el tama&ntilde;o del programa, y supongo que algunos virus
tambi&eacute;n lo usan. Ya he mandado el archivo a McAfee para que arreglen su VirusScan, y voy a
intentar enviarlo a algunos m&aacute;s que tambie&eacute;n hacen la detecci&oacute;n erronea, pero
mientras tanto he subido una versi&oacute;n sin compresi&oacute;n para evitar m&aacute;s problemas.
As&iacute; que si est&aacute;s usando un Antivirus cutre que da un falso positivo con SevenuP (y no
quieres dejar de usarlo), descarga la versi&oacute;n sin comprimir de la p&aacute;gina de descargas
a ver si se resulve el problema.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2006-09-24</I>:<DD>
<P><B><FONT SIZE="+1">Enlaces</FONT></B>
<P><UL>
<LI>A&ntilde;adido SjASMPlus a lista de ensambladores cruzados en la p&aacute;gina
de enlaces. Un excelente ensamblador muy avanzado.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2006-08-08</I>:<DD>
<P><B><FONT SIZE="+1">Enlaces</FONT></B>
<P><UL>
<LI>&iexcl;TommyGun por fin tiene su propia p&aacute;gina!.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2006-05-27</I>:<DD>
<P><B><FONT SIZE="+1">Enlaces</FONT></B>
<P><UL>
<LI>Enlace de TommyGun actualizado a la versi&oacute;n 0.9.3 . De ahora en adelante las
actualizaciones de TommyGun no se anunciar&aacute;n hasta que tenga su propia p&aacute;gina.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2006-05-07</I>:<DD>
<P><B><FONT SIZE="+1">Enlaces</FONT></B>
<P><UL>
<LI>Enlace de TommyGun actualizado a la versi&oacute;n 0.9.1 .
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2006-04-24</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 1.20</FONT></FONT></B>
<P>Novedades:
<P>
<UL>
<LI>(FreeBSD) &iexcl;Nuevo ejecutable para FreeBSD!
<LI>(Linux) (BUGFIX) eliminadas casi todas las optimizaciones de la versi&oacute;n 0.92, ya
que pueden provocar errores en los desplazamientos bajo determinadas (y desconocidas para
mi) circunstancias.
<LI>Enormes cambios en las opciones de salida para permitir a&uacute;n m&aacute;s
flexibilidad:
<UL>
<LI>Ahora se pueden entrelazar los atributos en frames, columnas o l&iacute;neas, y se pueden
sacar solo los atributos o poner los atributos delante.
<LI>Añadida una opci&oacute;n para sacar el tamaño en los dos primeros bytes, tal y como lo
necesita la librer&iacute;a de sprites estandar de z88dk.
<LI>Añadida una opci&oacute;n para sacar los datos gr&aacute;ficos haciendo un zigzag
horizontal.
<LI>Añadida una opci&oacute;n para sacar m&aacute;scaras de atributos, tal y como se usan en
splib3.
<LI>El nombre del sprite se usa ahora como etiqueta en ensamblador y como nombre del sprite
en C (pero la etiqueta en ASM se puede desactivar).
<LI>Añadida una opci&oacute;n en el archivo .ini para escojer la extensi&oacute;n por
defecto a la hora de exportar datos.
</UL>
<LI>(BUGFIX) Importantes correcciones en la importaci&oacute;n de im&aacute;genes:
<UL>
<LI>Un caracter con tan solo un color dominante no pod&iacute;a obtener el atributo de
brillo.
<LI>A veces se escog&iacute;a el mismo color para el papel y la tinta en el mismo caracter,
dejando un feo caracter vac&iacute;o.
<LI>La distribuci&oacute;n de pixels no estaba teniendo en cuenta el tamaño de las
subceldas, as&iacute; que es asombroso que funcionara.
</UL>
<LI>Optimizada la importaci&oacute;n un poquito.
<LI>(Win) Recompilada la librer&iacute;a para obtener un ejecutable algo m&aacute;s pequeño.
<LI>(Win) Cambio de UPX a Upack para obtener un ejecutable todav&iacute;a m&aacute;s pequeño.
<LI>(Linux) El binario se compila ahora en Gentoo 2006.0-amd64, gcc 3.4.3 con wxWidgets
2.6.2 para GTK2.x, no unicode. Necesitar&aacute;s actualizar las librer&iacute;as de
<A HREF="http://www.wxwidgets.org" target="_blank">http://www.wxwidgets.org</A> para hacerlo
funcionar.
<LI>(Linux) Compilado tambi&eacute;n un ejecutable de 64 bits.
<LI>(Linux) Cambio de UPX 1.25 a 1.94 para lograr un ejecutable mucho m&aacute;s pequeño
(y para que pueda comprimirse la versi&oacute;n de 64 bits).
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2006-04-22</I>:<DD>
<P><B><FONT SIZE="+1">Enlaces</FONT></B>
<P><UL>
<LI>Enlace de TommyGun actualizado a la versi&oacute;n 0.8.7 .
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2006-03-24</I>:<DD>
<P><B><FONT SIZE="+1">Enlaces</FONT></B>
<P><UL>
<LI>Enlace de TommyGun actualizado a la versi&oacute;n 0.8.5 .
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2006-02-23</I>:<DD>
<P><B><FONT SIZE="+1">Enlaces</FONT></B>
<P><UL>
<LI>Enlace de TommyGun actualizado a la versi&oacute;n 0.8.3, y actualizada su descripci&oacute;n.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2005-12-15</I>:<DD>
<P><B><FONT SIZE="+1">Enlaces</FONT></B>
<P><UL>
<LI>A&ntilde;adido ZX-Paintbrush a lista de editores gr&aacute;ficos.
<LI>Enlace de TommyGun actualizado a la versi&oacute;n 0.8 .
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2004-07-29</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 1.12</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>(BUGFIX) La exportaci&oacute;n de imagen exportaba siempre el primer frame de un
sprite en lugar de exportar el seleccionado actualmente.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2004-03-27</I>:<DD>
<P><B><FONT SIZE="+1">Nueva versi&oacute;n de BIN2TAP, m&aacute;s enlaces</FONT></B>
<P><UL>
<LI>Corregido un bug en BIN2TAP, que no calculaba el byte de checksum de la
cabecera BASIC, provocando un R Tape Loading Error cuando las direcciones de
comienzo y ejecuci&oacute;n eran diferentes.
<LI>A&ntilde;adido Pasmo a lista de ensambladores cruzados en la p&aacute;gina
de enlaces. Sin duda alguna mi favorito.
<LI>A&ntilde;adido TommyGun a lista de editores gr&aacute;ficos.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2003-08-21</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 1.11</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>A&ntilde;adidos algunos atajos de teclado mas.
<LI>(BUGFIX) Cambiar el modo de cursor desde los modos de relleno o pegado
manten&iacute;an dichos modos, aunque mostrando el set/reset.
<LI>(Linux) (BUGFIX) Se pueden grabar de nuevo archivos .SCR .
<LI>(Win) (BUGFIX) Corregido un importante bug gr&aacute;fico de la
librer&iacute;a wxWindows, que hac&iacute;a que el gr&aacute;fico se hundiera
en el marco cuando la ventana se cambiaba de tama&ntilde;o desde un
tama&ntilde;o que requer&iacute;a una barra vertical a otro que no, mientras
dicha barra vertical estaba bajada.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2003-08-02</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 1.10</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>Cambiada la disposici&oacute;n del men&uacute; File. Ahora "Save" se llama
"Fast Save", "Save As" y "Save .SCR" est&aacute;n ambos en la opci&oacute;n
"Save", y grabar a .BIN, .C y .ASM est&aacute;n todos en "Export Data".
<LI>Los directorios por defecto para abrir, importar, grabar y exportar se
leen de SevenuP.ini
<LI>Los &uacute;ltimos directorios utilizados se pueden recordar (configurable
en SevenuP.ini)
<LI>A&ntilde;adido "Append" a las opciones de salida, para poder acumular
todos los datos exportados en el mismo archivo.
<LI>A&ntilde;adidos un mont&oacute;n de atajos de teclado.
<LI>El pegado, relleno y relleno con textura ahora intercambian sus modos, en
lugar de limitarse a activarlos (esto mejora el control desde el teclado).
<LI>Cambiado el criterio para escoger el ink y el paper para mejorar la
importaci&oacute;n de gr&aacute;ficos de Spectrum.
<LI>Optimizada un poquito la rutina de importaci&oacute;n de im&aacute;genes
(cosa as&iacute; del 20%).
<LI>(Mac) Movido el archivo de configuraci&oacute;n SevenuP.ini .
<LI>(Source) Quitada la compatibilidad con wxWindows 2.2.9 (de todas formas,
no funcionaba bien en la versi&oacute;n anterior).
<LI>(BUGFIX) Los botones de Move up y Move Down del di&aacute;logo de las
opciones de salida no funcionaban desde la versi&oacute;n 0.95b .
<LI>(BUGFIX) Hacer un Fast Save justo despu&eacute;s de importar un
gr&aacute;fico sobreescribe la imagen reci&eacute;n importada sustituyendola
con el archivo .sev (con la extensi&oacute;n incorrecta).
<LI>(BUGFIX) La opci&oacute;n Eff_pixattr de SevenuP.ini no funcionaba
correctamente.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2003-06-23</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#00FF00">versi&oacute;n 1.00</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>Opciones de configuraci&oacute;n almacenadas en SevenuP.ini
 (&iexcl;por fin!).
<LI>Importaci&oacute;n de gr&aacute;ficos desde im&aacute;genes. Los
formatos soportados son: BMP, GIF, JPG, PNG, PCX, TIF, IFF y XPM.
<LI>Exportaci&oacute;n de gr&aacute;ficos a im&aacute;genes. Los formatos
soportados son: BMP, JPG, PNG, PCX, TIF y XPM.
<LI>AutoZoom para ajustarse al tama&ntilde;o de los archivos cargados.
<LI>Los atributos individuales (ink, paper, bright y flash) se muestran en
la barra de estado.
<LI>Actualizado wxWindows a la versi&oacute;n 2.4.1 . Se recomienda actualizar
la librer&iacute;a para Linux. Esto ha hecho que el tama&ntilde;o del
programa para Windows crezca bastante.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2003-05-31</I>:<DD>
<P><B><FONT SIZE="+1"><FONT color="#FFFF00">Aviso</FONT> para los usuarios de
Mac</FONT></B>
<P><UL>
<LI>Me acaba de comunicar James Weatherley que al igual que en la
versi&oacute;n de Linux, hace falta instalar la librer&iacute;a de wxWindows.
Y dado que no parece haber un binario disponible en la p&aacute;gina de
wxWindows, James lo ha colgado en su propia p&aacute;gina. Debeis descargarlo
y desenziparlo en /usr/local/lib
<LI><A HREF="http://weatherley.net/wxwindows/libwx_mac-2.4.0.dylib.zip">Librer&iacute;a de wxWindows</A>
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2003-05-30</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.95 beta</FONT> (no para Windows (no hay mejoras))</FONT></B>
<P>Novedades:
<P><UL>
<LI><B>(Mac) &iexcl;Nuevo ejecutable para MacOS X!</B>. Los botones de Bitmap son un
WIP (Work in Progress) de wxWindows para OS X, as&iacute; que se ver&aacute;
algo peor que en las versiones para x86.
<LI>Incrementada la anchura m&iacute;nima de la ventana para mostrar todos los
iconos de la barra de herramientas en Linux.
<LI>(Source) Ahora tambi&eacute;n compila usando wxWindows 2.4.0 . Esto
corrige el problema de b&uacute;squeda de archivos .s?? en lugar de .sev y
.src en Linux (problema mencionado en la versi&oacute;n 0.91).
<LI>(Linux) El ejecutable ahora ha sido compilado con Mandrake 9.1, gcc 2.3.2
y wxWindows 2.4.0 . Necesitareis instalar las nuevas librer&iacute;as de
de <A HREF="http://www.wxwindows.org">http://www.wxwindows.org</A> para hacerlo
funcionar.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2003-03-18</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.94 beta</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>A&ntilde;adidas rotaciones de 90 grados al men&uacute; de efectos y a la
barra de herramientas.
<LI>A&ntilde;adido un parche de Dominic Morris para cargar archivos .SCR
parciales.
<LI>(BUGFIX) Para los sprites, el n&uacute;mero de frames no se mostraba en
el c&oacute;digo fuente en C o ASM, sino que aparec&iacute;a de nuevo el
tama&ntilde;o en pixels.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2003-01-26</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.93 beta</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>(Win) (BUGFIX) Al ejecutarse, la v0.92 se quedaba en un estado
extra&ntilde;o hasta que se cargara o creara un gr&aacute;fico.
<LI>(Win) (BUGFIX) Al hacer doble click para seleccionar un archivo (por
ejemplo, para cargarlo), ya no realizar&aacute; una acci&oacute;n sobre el
pixel donde el nombre del archivo fue clickeado.
<LI>(BUGFIX) Cerrar el &uacute;ltimo archivo no dejar&aacute; su tama&ntilde;o
en el recuadro (esto se pod&iacute;a observar al cambiar el zoom antes de
cargar o crear otro gr&aacute;fico).
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2003-01-16</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.92 beta</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>Muchas optimizaciones de velocidad a los modos sin bitmap: cuando solo
est&aacute; activa la rejilla de car&aacute;cteres, ahora tarda el 83% aprox.
del tiempo anterior para generar la pantalla, la pantalla no se regenera
cuando solo necesitamos limpiarla, cuando cambiamos de tama&ntilde;o o la
desplazamos solo se recalculan las partes nuevas, y por &uacute;ltimo la
(des)selecci&oacute;n solo refresca ahora las partes (des)seleccionadas. La
aceleraci&oacute;n es mayor en Linux, dado que el evento de
actualizaci&oacute;n de pantalla ocurre mas a menudo.
<LI>A&ntilde;adidos algunos chequeos a la cabecera de los archivos cargados,
para evitar cuelgues con archivos corruptos.
<LI>El warning en los archivos inv&aacute;lidos muestra el nombre del archivo
que falla. Tambi&eacute;n aparece el nombre al grabar con la opci&oacute;n
"Save" del men&uacute;.
<LI>A&ntilde;adida una prueba para saber si existe el archivo que queremos
cargar.
<LI>A&ntilde;adidos algunos atajos de teclado al men&uacute; Edit.
<LI>(BUGFIX) Al usar la opci&oacute;n "Save" del men&uacute; para grabar un
archivo .SCR se grababa un .SEV manteniendo la extensi&oacute;n .SCR .
<LI>(BUGFIX) Renombrar un sprite (o renombrar un gr&aacute;fico y
transformarlo despu&eacute;s en sprite a&ntilde;adiendo frames) no mostraba el
&uacute;ltimo car&aacute;cter del nuevo nombre en la barra del t&iacute;tulo.
<LI>(BUGFIX) Las rejillas ten&iacute;an un problemita en la v0.91 .
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2003-01-04</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.91 beta</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>Drag & Drop de m&uacute;ltiples archivos .SEV y .SCR.
<LI>Tambi&eacute;n se pueden cargar m&uacute;ltiples archivos desde la linea
de comandos.
<LI>Tanto los archivos .SEV como los .SCR se cargan desde la misma
opci&oacute;n de men&uacute; Load, en lugar de utilizar opciones distintas
para cada uno. (En Linux, al buscar ambos tipos de archivos se presentan
todos los *.s*, debido a una limitaci&oacute;n de la librer&iacute;a).
<LI>Al seleccionar los frames siguientes o anteriores del sprite, se pasa del
primero al &uacute;ltimo y viceversa.
<LI>Optimizados los modos sin bitmap. El modo 4x4 ahora tarda cosa as&iacute;
del 52% de lo que tardaba antes, y en el resto de modos tarda entre 100%-59%
dependiendo de las rejillas activadas.
<LI>(Linux) (BUGFIX) Desde la v0.6, cargar dos o mas gr&aacute;ficos con el
mismo nombre (o el mismo varias veces) se cargaba las asociaciones de teclado
de tipo "Ctrl+(n&uacute;mero)". No es mi culpa, sino un bug de la
librer&iacute;a, as&iacute; que estoy a&ntilde;adiendo un n&uacute;mero de
prefijo para evitar el problema.
<LI>(Win) Recompilada la librer&iacute;a eliminando los mecanismos de debug
para lograr un ejecutable mas peque&ntilde;o.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-12-28</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.9 beta</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>SevenuP tiene ahora su propio icono.
<LI>Deshacer y rehacer (hasta 4 pasos) para el frame actual (cambiar a otro
frame o gr&aacute;fico hace que se pierda el historial), y suprimida por lo
tanto la advertencia al borrar.
<LI>A&ntilde;adidos otros 2 elementos al menu sprite: Move frame, para cambiar
la posici&oacute;n del frame actual, y Select frame number, para saltar
directamente a un determinado frame.
<LI>SevenuP intenta abrir el primer argumento de la linea de comando,
permitiendo la asociaci&oacute;n de archivos .SEV . Tambi&eacute;n se pueden
cargar .SCRs desde la linea de comandos, pero la asociaci&oacute;n ser&aacute;
m&aacute;s dificil debido a la existencia de los est&uacute;pidos
salvapantallas de Windows.
<LI>Reducido algo de uso de memoria que no era necesaria.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-12-22</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.8 beta</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>SOPORTE DE SPRITES (&iexcl;Por fin!):
<UL>
<LI>Men&uacute; de Sprites donde se pueden a&ntilde;adir o quitar frames y
seleccionar sobre cual vamos a trabajar.
<LI>El frame seleccionado se muestra en la barra del t&iacute;tulo si hay mas
de un frame.
<LI>La selecci&oacute;n de frame tambi&eacute;n puede realizarse con los 2
nuevos iconos de la barra de herramientas.
<LI>Evidentemente, existe un nuevo campo (Frame number) en la lista de
prioridad de ordenaci&oacute;n de los bytes de las opciones de salida.
<LI>El formato .SEV se ha extendido para habilitar el uso de Sprites. Los
nuevos .SEVs no cargar&aacute;n en versiones mas antiguas de SevenuP.
<LI>El n&uacute;mero de frames est&aacute; limitado a 32, o menos si el
sprite es demasiado grande (hasta 41K si se usan m&aacute;scara y atributos).
</UL>
<LI>Modificado el di&aacute;logo de File->New, ya que los sprites se crean
simplemente a&ntilde;adiendo frames a un gr&aacute;fico, y he decidido no
a&ntilde;adir finalmente soporte para animaciones porque creo que es mejor
probar los gr&aacute;ficos directamente en el Spectrum (emulado o real).
<LI>Las opciones de los efectos est&aacute;n ahora en la parte de arriba de
su men&uacute;, ya que los efectos son facilmente accesibles en la barra de
herramientas.
<LI>El men&uacute; de zoom muestra ahora el modo actual.
<LI>Los gr&aacute;ficos pueden ser ahora renombrados desde el men&uacute;
File.
<LI>Solo los campos relevantes son tomados en consideraci&oacute;n para los
archivos .C y .ASM, para los retornos de carro y la informaci&oacute;n sobre
prioridad de ordenaci&oacute;n.
<LI>(BUGFIX) Meter valores de tama&ntilde;o ilegales ya no cascar&aacute; el
programa en ciertos casos.
<LI>(Source) A&ntilde;adido por fin un makefile para Unix.
<LI>El origen del nombre del programa ha sido por fin desvelado ;-) (mirad
las instrucciones).
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-12-10</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.71 beta</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>A&ntilde;adidos formatos de salida .ASM en hexadecimal.
<LI>Salvar un archivo .SCR tambi&eacute;n borra la bandera del "Are you sure?".
<LI>(BUGFIX) Cambiar el gr&aacute;fico actual ya no deja marcada el
&aacute;rea seleccionada del gr&aacute;fico anterior en los zooms con
bitmaps.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-10-18</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.7 beta</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>Quitadas las etiquetas del c&oacute;digo en ASM.
<LI>A&ntilde;adido men&uacute; de relleno con rellenos s&oacute;lido y con
textura.
<LI>A&ntilde;adida m&aacute;scara autom&aacute;tica.
<LI>A&ntilde;adido nuevo modo de cursor, que reemplaza el Get/Set attributes
al editar la m&aacute;scara, permitiendo cambiar al mismo tiempo tanto la
m&aacute;scara como el gr&aacute;fico.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-09-25</I>:<DD>
<P><B><FONT SIZE="+1">Detectado problema en Linux</FONT></B>
<P><UL>
<LI>Hay un problema con la versi&oacute;n ejecutable de Linux. Parece ser
que estoy usando una versi&oacute;n antigua de libpng, as&iacute; que es
posible que obtengas el siguiente mensaje de error al intentar ejecutar
SevenuP:
<PRE>./SevenuP: error while loading shared libraries:
<BR>libpng12.so.0: cannot open shared object file:
<BR>No such file or directory</PRE>
<LI>Intantar&eacute; subir un ejecutable corregido pronto, mientras tanto como
arreglo provisional puedes enlazar la nueva librer&iacute;a al nombre de la
antigua, tecleando esto cuando est&eacute;s en /usr/lib:
<FONT color="#FFFF00">ln -s libpng.so.2 libpng12.so.0</FONT>
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-09-22</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.61 beta</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>Limpieza del c&oacute;digo y a&ntilde;adidos algunos comentarios.
<LI>(BUGFIX) Copiar desde la m&aacute;scara ya no copia los atributos del
gr&aacute;fico.
<LI>Limitado el tama&ntilde;o m&aacute;ximo del frame a 1280x1024, para evitar
que la gente con monitores enormes casquen el programa haciendo que el cuadro
del gr&aacute;fico sea mayor que el tama&ntilde;o interno del bitmap.
<LI>Peque&ntilde;a correcci&oacute;n de seguridad: ciertos archivos .SEV
corruptos cascaban el programa. Ahora ya no.
<LI>Licencia cambiada de Freeware a GPL, y liberado por lo tanto el
c&oacute;digo fuente.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-09-04</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.6
beta</FONT> y subida al Wos (World of Spectrum)</FONT></B>
<P>Novedades:
<P><UL>
<LI>SevenuP pasa de ser alpha a beta.
<LI>Mejorada la documentaci&oacute;n.
<LI>Integrado todo en la misma ventana.
<LI>El nombre del gr&aacute;fico aparece en la ventana (y se usa por
defecto para salvar).
<LI>Se pueden cambiar los diferentes gr&aacute;ficos abiertos desde el
men&uacute; File o usando el teclado (CTRL+tecla de funci&oacute;n
(CTRL+n&uacute;mero en Linux, las teclas de funci&oacute;n ya est&aacute;n
pilladas), limitando el n&uacute;mero m&aacute;ximo de archivos abiertos
a 12 (incluso en Linux, donde solo se puede acceder por teclado a los 10
primeros)).
<LI>A&ntilde;adido soporte de m&aacute;scaras. Usar m&aacute;scaras cuesta
memoria y velocidad, as&iacute; que se recomienda dejar el dise&ntilde;o de
m&aacute;scaras para el final. La m&aacute;scara entra en las prioridades
de ordenaci&oacute;n de la salida, y puede colocarse antes o despu&eacute;s
del gr&aacute;fico.
<LI>Cambiado ligeramente el formato interno .SEV, para permitir el uso de
m&aacute;scaras. Los nuevos .SEVs no funcionar&aacute;n con las versiones
alpha de SevenuP (la v0.52 no avisa debido a un bug WIP (work in progress),
las dem&aacute;s si).
<LI>(BUGFIX) En la 0.52, el formato de salida de los ensambladores tniASM y
The E-Z80 Way se mezcl&oacute;, por lo que la salida de tniASM quedaba algo
fea y la de The E-Z80 Way incorrecta. Corregido.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-08-05</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.52 alpha</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>Peque&ntilde;as correcciones a la documentaci&oacute;n, ahora
tambi&eacute;n disponible en espa&ntilde;ol.
<LI>Optimizaciones de velocidad. La carga o creaci&oacute;n de nuevos
gr&aacute;ficos y los efectos deber&iacute;an ser bastante mas r&aacute;pidos
ahora. El modo 4x4 ya no usa bitmap, por lo tanto ahora adem&aacute;s SevenuP
usa menos memoria, pero ser&aacute; mas lento en este modo.
<LI>El ensamblador ZCAV2 ha sido renombrado a "The E-Z80 Way", realizados los
cambios pertinentes.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-07-24</I>:<DD>
<P><B><FONT SIZE="+1">&iexcl;Opps! &iexcl;GRAN BUG!, por lo tanto liberada la <FONT color="#FFFF00">versi&oacute;n 0.51 alpha</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>(BUGFIX) El pegado a&ntilde;ad&iacute;a basura por debajo de la zona
pegada en determinados casos. Corregido.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-07-21</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.5 alpha</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>A&ntilde;adida documentaci&oacute;n preliminar (de momento s&oacute;lo en
ingl&eacute;s).
<LI>La barra de estado es un poco mas informativa en el modo de
selecci&oacute;n.
<LI>A&ntilde;adidos di&aacute;logos del tipo "&iquest;Est&aacute;s seguro?" al
cierre de ventanas y el uso de Erase.
<LI>A&ntilde;adido men&uacute; de Zoom para ir de cualquier nivel de zoom a
otro directamente sin tener que pasar por los intermedios.
<LI>Eliminado parpadeo al cambiar de zoom.
<LI>A&ntilde;adido men&uacute; de edici&oacute;n con Copy y Paste (copiar y
pegar). Ahora se pueden copiar y pegar gr&aacute;ficos o fragmentos de una
ventana de edici&oacute;n a otra sin ning&uacute;n problema.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-07-09</I>:<DD>
<P><B><FONT SIZE="+1">Un nuevo ensamblador</FONT></B>
<P><UL>
<LI>A&ntilde;adido ZMAC a lista de ensambladores cruzados en la p&aacute;gina
de enlaces. Posiblemente sea el mejor de los que he probado hasta ahora:
freeware, c&oacute;digo abierto, r&aacute;pido y sin ninguna rareza en
el c&oacute;digo admitido (AS80 tampoco tiene ninguna rareza, pero es solo
para DOS/Windows).
<LI>Los ensambladores compatibles con Linux aparecen destacados en
<FONT color="#FFFF00">amarillo</FONT>.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-07-08</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.4 alpha</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>El icono de cambio de cursor se ha cambiado por otro con mas significado.
<LI>El atributo del car&aacute;cter actual aparece en la barra de estado.
<LI>Reactivados botones del Flash (aunque el Flash en si sigue sin mostrarse).
<LI>A&ntilde;adido modo de cursor para obtener atributos.
<LI>A&ntilde;adido modo de cursor de selecci&oacute;n, de forma que se pueden
aplicar los efectos solo a una cierta &aacute;rea del gr&aacute;fico.
<LI>A&ntilde;adidos efectos de rotaci&oacute;n/desplazamiento tanto a nivel
de car&aacute;cter como a nivel de bit.
<LI>Las opciones de los efectos se especifican en un di&aacute;logo.
<LI>Cambiado el Layout de la edici&oacute;n, ahora una pantalla de Spectrum
completa cabe en la pantalla a zoom x3 si tienes una resoluci&oacute;n de
1024 x 768 (bajo Windows), y hay mas espacio para la barra de herramientas.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-06-27</I>:<DD>
<P><B><FONT SIZE="+1">Un par de cambios</FONT></B>
<P><UL>
<LI>A&ntilde;adidos algunos enlaces.
<LI>Modificado BIN2TAP para que acepte como argumentos el comienzo del
c&oacute;digo y el punto de ejecuci&oacute;n, en lugar de asumir que ambos
son siempre 32768. Adem&aacute;s he creado una variante (BIN2CODE) que tan
solo crea el bloque de c&oacute;digo, sin a&ntilde;adir ninguna cabecera
BASIC. Encontrar&aacute;s ambos programas en la secci&oacute;n de Enlaces.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-06-24</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.3 alpha</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>A&ntilde;adido soporte nativo para los ensambladores TASM, tniASM y ZCAV2.
<LI>El soporte de ensamblador gen&eacute;rico se ha cambiado para mejorar la
compatibilidad, a&ntilde;adiendo un ":" al final de las etiquetas. Este modo
ha sido probado con &eacute;xito con los ensambladores AS80, Z80v4, Z80-ASM y
Z80ASM.
<LI>Efecto de inversi&oacute;n
<LI>Efectos flip horizontal y vertical.
<LI>Los efectos pueden afectar solo a los pixels, solo a los atributos o a ambos.
<LI>Las opciones de salida se especifican en una opci&oacute;n del men&uacute;
File, no cada vez que se salva.
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-05-23</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.2 alpha</FONT></FONT></B>
<P>Novedades:
<P><UL>
<LI>Grabaci&oacute;n en formatos binario (.BIN), fuente en C (.C) y fuente en
ensamblador (.ASM), y con cualquiera de ellos puedes escoger la prioridad de
ordenaci&oacute;n de los bytes, y si quieres los atributos al final, como
noveno byte del car&aacute;cter o sin atributos.
<LI>(Win) Recompilada la librer&iacute;a para lograr un ejecutable mas
peque&ntilde;o.
<LI>Mejorado el comportamiento del trazado continuo cuando el puntero sale del
marco y entra con el bot&oacute;n pulsado, aunque todav&iacute;a no es
perfecto.
<LI>Cambiada la paleta, para una mejor distinci&oacute;n del brillo.
<LI>(BUGFIX) El trazado continuo estaba dibujando el primer pixel dos veces,
causando problemas en el modo de cambio (Toggle).
<LI>Grabaci&oacute;n de .SCR .
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-05-15</I>:<DD>
<P><B><FONT SIZE="+1">Creada p&aacute;gina web</FONT></B>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-05-13</I>:<DD>
<P><B><FONT SIZE="+1">Liberada la <FONT color="#FFFF00">versi&oacute;n 0.1
alpha</FONT> y anunciada tambi&eacute;n en <i>comp.sys.sinclair</i></FONT></B>
<P>Novedades:
<P><UL>
<LI>(Linux) Desactivados botones de flash.
<LI>(Linux) Se muestra la versi&oacute;n en Info.
<LI>(Win) El directorio de carga y grabaci&oacute;n por defecto es el actual,
no "Mis Documentos".
<LI>Todos los colores por defecto en transparente.
<LI>Carga de .SCR .
<LI>Al cambiar el modo de cursor se muestra el modo actual
inmediatamente.
<LI>Nuevos modos de zoom. En total los niveles actuales son: 1, 2, 3, 4,
6, 8, 12, 16, 20, 25, 32, 40 y 48, y comienzan a tener rejilla desde
el 6.
<LI>A&ntilde;adida rejilla de caracteres.
<LI>Las rejillas son opcionales.
<LI>Reescritura total del c&oacute;digo de generaci&oacute;n de pantalla.
Ahora tarda un poquit&iacute;n en crear o cargar los gr&aacute;ficos, pero la
aceleraci&oacute;n en el refresco de la pantalla y en los modos de zoom mas
peque&ntilde;os (sin rejilla) es BRUTAL.
<LI>(BUGFIX) Corregido un bug en la rutina de grabaci&oacute;n. No estaba
creando los archivos binarios correctamente as&iacute; que se salvaba basura
extra por cada c&oacute;digo de ENTER que transformaba.
<LI>Trazado continuo (algo lento, tal vez lo ponga como opcional en
futuras versiones).
</UL>
<BR>&nbsp;
<BR>&nbsp;
<DT><I>2002-05-09</I>:<DD>
<P><B><FONT SIZE="+1">Liberada y anunciada (en <i>es.comp.sistemas.sinclair</i>) la <FONT color="#FFFF00">versi&oacute;n 0.0 alpha</FONT></FONT></B>
</DL>
</BODY>
</HTML>
